import math

print('██████╗░███████╗██╗░░░░░████████╗░█████╗░ \n██╔══██╗██╔════╝██║░░░░░╚══██╔══╝██╔══██╗ \n██║░░██║█████╗░░██║░░░░░░░░██║░░░███████║ \n██║░░██║██╔══╝░░██║░░░░░░░░██║░░░██╔══██║ \n██████╔╝███████╗███████╗░░░██║░░░██║░░██║ \n╚═════╝░╚══════╝╚══════╝░░░╚═╝░░░╚═╝░░╚═╝', flush=True)
print('ПРИМЕЧАНИЕ: Это калькулятор миномётчика для вычисления значений по ВЕРТИКАЛИ,\nсделанный для советских миномётов в ARMA REFORGER, только для четырёх колечных фугасных снарядов.\nМинимальное значение расстояние 400, а максимальное 2300.\n')

rest = 1
tabl = {"400": "1418$10", "500": "1398$11", "600": "1376$10", "700": "1355$11", "800": "1333$11", "900": "1311$12", "1000": "1288$12", "1100": "1264$12", "1200": "1240$13", "1300": "1215$13", "1400": "1189$14", "1500": "1161$14", "1600": "1133$15", "1700": "1102$16", "1800": "1069$17", "1900": "1034$19", "2000": "995$22", "2100": "950$26", "2200": "896$34", "2300": "820$65"}
while rest == 1:
    print('ВВЕДИТЕ РАССТОЯНИЕ ДО ЦЕЛИ (в метрах)')
    dist = int(input())
    print('ВВЕДИТЕ ВЫСОТУ, НА КОТОРОЙ НАХОДИТСЯ МИНОМЁТ (в метрах).')
    y1 = int(input())
    print('ВВЕДИТЕ ВЫСОТУ, НА КОТОРОЙ НАХОДИТСЯ ЦЕЛЬ (в метрах).')
    y2 = int(input())


    z = str(math.floor(dist/100)*100)
    v = str(math.ceil(dist/100)*100)
    t1 = tabl[str(z)]
    t2 = tabl[str(v)]
    p1 = int(t1.split('$')[0])
    p2 = int(t2.split('$')[0])
    zw1 = int(t1.split('$')[1])
    zw2 = int(t2.split('$')[1])
    p = p1-(((p1-p2)/100)*(int(str(dist)[-2:])))
    zw = (zw1+zw2)/2
    if y1 > y2:
        raz = (y1 - y2)/100
        z = zw * raz
        print(f'ЗНАЧЕНИЕ ПО ВЕРТИКАЛИ: {round(p + z)}')
    elif y1 < y2:
        raz = (y2 - y1)/100
        z = (zw * raz) + 4
        print(f'ЗНАЧЕНИЕ ПО ВЕРТИКАЛИ: {round(p - z)}')
    elif y1 == y2:
        print(f'ЗНАЧЕНИЕ ПО ВЕРТИКАЛИ: {round(p)}')
    print('ПРОИЗВЕСТИ РАСЧЁТЫ СНОВА? ДА = 1, НЕТ = 0')
    rest = int(input())