import time

print("███████╗██████╗  █████╗ ███╗   ███╗██╗    ██╗")
print("██╔════╝██╔══██╗██╔══██╗████╗ ████║██║    ██║")
print("███████╗██████╔╝███████║██╔████╔██║██║ █╗ ██║")
print("╚════██║██╔═══╝ ██╔══██║██║╚██╔╝██║██║███╗██║")
print("███████║██║     ██║  ██║██║ ╚═╝ ██║╚███╔███╔╝")
print("╚══════╝╚═╝     ╚═╝  ╚═╝╚═╝     ╚═╝ ╚══╝╚══╝ ")
print()

key = input("Введіть ключ: ")

if key != "YAKRUTOI123":
    print("Невірний ключ!")
    exit()

print("Ключ правильний ✅")

count = int(input("Скільки повідомлень вивести: "))
speed = float(input("Скільки повідомлень в секунду: "))
message = input("Введіть текст повідомлення: ")

delay = 1 / speed

for i in range(count):
    print(f"[{i+1}] {message}")
    time.sleep(delay)

print("Готово!")