print ("Тест по истории. Эпоха дворцовых переворотов")
print ("Правление Екатерины I")
print ("1. 1725-1727. 2. 1689-1700. 3. 1730-1735.") 
vibor1=input("Выберите номер ответа: ")

while True:

    if vibor1=="1":
        print("Поздравляю")
    else:
        print("Упс... не верно")

    print("Когда был заключен нерчинский договор с Китаем")
    print("1. 1724 2. 1720 3. 1689")
    vibor2=input("Выберите номер ответа: ")

    if vibor2=="3":
        print ("Поздравляю")
    else:
        print("Упс... не верно")

    print("Правление Иоанна VI Антоновича")
    print("1. 1727-1730 2. 1731-1736 3. 1740-1741")
    vibor3=input("Выберите номер ответа: ")

    if vibor3=="3":
        print("Поздравляю")
    else:
        print("Упс... не верно")
    print ("Годы Русско-турецкой войны")
    print ("1. 1735-1740 2. 1735-1739 3. 1730-1739")
    vibor4=input("Выберите номер ответа: ")

    if vibor4=="2":
           print("Поздравляю")
    else:
        print("Упс... не верно")
    break
print("Тест закончился")
