import random
import time

while True:
    races = [
        "Ведьмовская кровь", "Возрождённый", "Дампир", "Своё происхождение", "Ааракокра",
        "Аасимар", "Багбир", "Гитцерай", "Гитьянки", "Глубинный гном", "Гоблин", "Голиаф",
        "Дженази", "Дуэргар", "Зайцегон", "Кенку", "Кентавр", "Кобольд", "Людоящер",
        "Минотавр", "Морской эльф", "Орк", "Сатир", "Табакси", "Тортл", "Тритон", "Фирболг",
        "Фэйри", "Хобгоблин", "Чейнджлинг", "Шадар-кай", "Шифтер", "Эладрин", "Юань-ти",
        "Глючный", "Ревнант", "Хобгоблин из Страны Фей", "Хабарыс", "Человек", "Авен",
        "Нага", "Хенра", "Человек", "Люди Иннистрада", "Гнолл", "Гном", "Дампир", "Дварф",
        "Зиморожденные полурослики", "Кентавр", "Кобольд Мидгарда", "Кованый", "Люди Мидгарда",
        "Людоворон", "Людокрыса", "Людомедведь", "Минотавр", "Теневая фея", "Троллеобразный",
        "Эльф", "Анафемный тифлинг", "Вапитанец", "Вегепигмей", "Глубинный дварф (И'ха-нтлей)",
        "Гоббок", "Голин", "Грацеза", "Дампир", "Древан", "Исэцу", "Кадавр", "Кицунз",
        "Котовец", "Липсик", "Лотол", "Львиная черепаха", "Манекен", "Мицелиан", "Мышинец",
        "Нискин", "Омбраск", "Онирождённый", "Полусторонний", "Порождение Бедствия",
        "Пробужденный", "Проклятковый", "Родзин", "Сильва", "Склизьш", "Слизевик",
        "Стик'Ти'Кал", "Стрекающие", "Теракет", "Тлеющий", "Тэнгу", "Флорен", "Фунаюрэй",
        "Ханамори", "Ханива", "Циклопланец", "Энкох", "Аракоқара", "Ведалкен", "Гном",
        "Дженази", "Кенку", "Локата", "Плазмоид", "Совлин", "Тритон", "Чейнджлинг", "Аасимар",
        "Вердан", "Гоблин", "Драконорождённый", "Кентавр", "Локсодон", "Полуорк", "Табакси",
        "Фирболг", "Человек", "Автогном", "Гибрид Симиков", "Голиаф", "Зайцегон", "Кобольд",
        "Людоядчер", "Полуорслик", "Тифлинг", "Фэйри", "Шифтер", "Астральный эльф", "Гит",
        "Грунг", "Калаштар", "Кованый", "Минотавр", "Полузльф", "Тортл", "Хадози", "Эльф",
        "Багбир", "Гифф", "Дварф", "Кендер", "Леонин", "Орк", "Сатир", "Три-крин", "Хобгоблин",
        "Юань-ти"
    ]

    print("\n\n\n\n")  # 4 пустые строки перед выводом
    x = random.choice(races)
    print(x)
    
    a = input("\nещё рассу? да/нет: ")

    if a == "нет":
        break