import os
import time
import sys
import shutil
#просто импорты 

title = "Название вашего клиента (название cmd) "
# тут итак все понятно 
print(" ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ akiriusekom НА ОСНОВЕ ЛОУДЕРА NuckerDLC1337 (P.s. слздатель лоудер для akirius akiriusek) ") 

#СКРЫТИЕ ЭТОЙ СТРОКИ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА
# ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ akiriusekom НА ОСНОВЕ ЛОУДЕРА NuckerDLC1337 (P.s. слздатель лоудер для akirius akiriusek) ") #СКРЫТИЕ ЭТОЙ СТРОКИ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА


#os.system("files\\funpay.bat") 
# при жилании можно убрать запуск файла funpay.bat с коментирования (там мой фан пец можете заменить на свой просто написать в батнике start <<ccылка на фанпей>> и указать до него путь лучше пихать в папку files
#shutil.rmtree("C:\Nurik")
#данная страка удаляет папку Nurik с C:\ советую уберать с коментирования 
time.sleep(3)
os.system('cls' if os.name == 'nt' else 'clear')
#time.sleep(3) значит что после запуска через 1 секунду запуститься лоудер подробнее тут > https://docs.python.org/3/library/time.html <
print("                 ░█████╗░██╗░░░░░██╗███████╗███╗░░██╗████████╗") 
print("                 ██╔══██╗██║░░░░░██║██╔════╝████╗░██║╚══██╔══╝") 
print("                 ██║░░╚═╝██║░░░░░██║█████╗░░██╔██╗██║░░░██║░░░") 
print("                 ██║░░██╗██║░░░░░██║██╔══╝░░██║╚████║░░░██║░░░") 
print("                ╚█████╔╝███████╗██║███████╗██║░╚███║░░░██║░░░") 
print("                ░╚════╝░╚══════╝╚═╝╚══════╝╚═╝░░╚══╝░░░╚═╝░░░")
#тут вставляем ваш текст! 
print("                            [TG]:NuckerDLC1337 ") 
print("                            [-]Version:free/prem. (или ваша версия) ") 
print("                            [-] Minecraft:1.16.5 ") 
time.sleep(2)
os.system('cls' if os.name == 'nt' else 'clear')
# ↑ отчистка строки ↑
print("                 ░█████╗░██╗░░░░░██╗███████╗███╗░░██╗████████╗") 
print("                 ██╔══██╗██║░░░░░██║██╔════╝████╗░██║╚══██╔══╝") 
print("                 ██║░░╚═╝██║░░░░░██║█████╗░░██╔██╗██║░░░██║░░░") 
print("                 ██║░░██╗██║░░░░░██║██╔══╝░░██║╚████║░░░██║░░░") 
print("                ╚█████╔╝███████╗██║███████╗██║░╚███║░░░██║░░░") 
print("                ░╚════╝░╚══════╝╚═╝╚══════╝╚═╝░░╚══╝░░░╚═╝░░░")
#тут вставляем ваш текст! 
print("                            [TG]:NuckerDLC1337 ") 
print("                            [-]Version:free/prem. (или ваша версия) ") 
print("                            [-] Minecraft:1.16.5 ") 
print("                            [-] Загрузка Файлов Игры [1/3]") 

print("█▀ ▄▄ ▀█") 
print("█▄ ░░ ▄█")
time.sleep(1) 
os.system('cls' if os.name == 'nt' else 'clear')
# ↑ отчистка строки ↑
print("                 ░█████╗░██╗░░░░░██╗███████╗███╗░░██╗████████╗") 
print("                 ██╔══██╗██║░░░░░██║██╔════╝████╗░██║╚══██╔══╝") 
print("                 ██║░░╚═╝██║░░░░░██║█████╗░░██╔██╗██║░░░██║░░░") 
print("                 ██║░░██╗██║░░░░░██║██╔══╝░░██║╚████║░░░██║░░░") 
print("                ╚█████╔╝███████╗██║███████╗██║░╚███║░░░██║░░░") 
print("                ░╚════╝░╚══════╝╚═╝╚══════╝╚═╝░░╚══╝░░░╚═╝░░░")
#тут вставляем ваш текст! 
print("                            [TG]:NuckerDLC1337 ") 
print("                            [-]Version:free") 
print("                            [-] Minecraft:1.16.5 ") 
print("                            [-] Загрузка Файлов Игры [2/3]") 

print("█▀ ▄▄ ▄▄ ▀█") 
print("█▄ ░░ ░░ ▄█") 
time.sleep(1) 
os.system('cls' if os.name == 'nt' else 'clear')
# ↑ отчистка строки ↑
print("                 ░█████╗░██╗░░░░░██╗███████╗███╗░░██╗████████╗") 
print("                 ██╔══██╗██║░░░░░██║██╔════╝████╗░██║╚══██╔══╝") 
print("                 ██║░░╚═╝██║░░░░░██║█████╗░░██╔██╗██║░░░██║░░░") 
print("                 ██║░░██╗██║░░░░░██║██╔══╝░░██║╚████║░░░██║░░░") 
print("                ╚█████╔╝███████╗██║███████╗██║░╚███║░░░██║░░░") 
print("                ░╚════╝░╚══════╝╚═╝╚══════╝╚═╝░░╚══╝░░░╚═╝░░░")
#тут вставляем ваш текст! 
print("                            [TG]:NuckerDLC1337 ") 
print("                            [-]Version:free") 
print("                            [-] Minecraft:1.16.5 ") 
print("                            [-] Загрузка Файлов Игры [3/3]") 

print("█▀ ▄▄ ▄▄ ▄▄ ▀█") 
print("█▄ ░░ ░░ ░░ ▄█") 
time.sleep(1) 
os.system('cls' if os.name == 'nt' else 'clear')
# ↑ отчистка строки ↑
print("                 ░█████╗░██╗░░░░░██╗███████╗███╗░░██╗████████╗") 
print("                 ██╔══██╗██║░░░░░██║██╔════╝████╗░██║╚══██╔══╝") 
print("                 ██║░░╚═╝██║░░░░░██║█████╗░░██╔██╗██║░░░██║░░░") 
print("                 ██║░░██╗██║░░░░░██║██╔══╝░░██║╚████║░░░██║░░░") 
print("                ╚█████╔╝███████╗██║███████╗██║░╚███║░░░██║░░░") 
print("                ░╚════╝░╚══════╝╚═╝╚══════╝╚═╝░░╚══╝░░░╚═╝░░░")
#тут вставляем ваш текст! 
print("                            [TG]:NuckerDLC1337 ") 
print("                            [-]Version:free) ")
print("                            [-] Minecraft:1.16.5 ") 
print("                            [+] <<название клиента>> Запускается ")
time.sleep(2) 
print(" ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ akiriusekom НА ОСНОВЕ ЛОУДЕРА NuckerDLC1337 (P.s. слздатель лоудер для akirius akiriusek) ") #СКРЫТИЕ ЭТОЙ СТРОКИ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА
time.sleep(2) 
os.system('cls' if os.name == 'nt' else 'clear')
os.system("java -noverify -Xmx2048M -Djava.library.path=.\natives;.\ -cp .\client.jar net.minecraft.client.main.Main --username %Nick% User43 854 --height 480 --version Optifine --gameDir C:\Minecraft\game --assetsDir .\assets --assetIndex 1.16 --uuid N/A --accessToken 0 --userType mojang") 
#↑↑ Строка запуска ↑↑

#строка выше удаление папки logs после выхода P. s. кто то в коментах просил это зделать 
time.sleep(3) 
sys.exit

# ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ akiriusekom НА ОСНОВЕ ЛОУДЕРА NuckerDLC1337 (P.s. слздатель лоудер для akirius akiriusek) ") #СКРЫТИЕ ЭТОЙ СТРОКИ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА
# ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ akiriusekom НА ОСНОВЕ ЛОУДЕРА NuckerDLC1337 (P.s. слздатель лоудер для akirius akiriusek) ") #СКРЫТИЕ ЭТОЙ СТРОКИ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА
# ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ akiriusekom НА ОСНОВЕ ЛОУДЕРА NuckerDLC1337 (P.s. слздатель лоудер для akirius akiriusek) ") #СКРЫТИЕ ЭТОЙ СТРОКИ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА
# ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ akiriusekom НА ОСНОВЕ ЛОУДЕРА NuckerDLC1337 (P.s. слздатель лоудер для akirius akiriusek) ") #СКРЫТИЕ ЭТОЙ СТРОКИ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА
# ДАННЫЙ ЛОУДЕР БЫЛ ЗДЕЛАТЬ akiriusekom НА ОСНОВЕ ЛОУДЕРА NuckerDLC1337 (P.s. слздатель лоудер для akirius akiriusek) ") #СКРЫТИЕ ЭТОЙ СТРОКИ КАРАЕТЬСЯ СЛИВОМ ЛОУДЕРА

#                 /\// YouTube /\//

#нету

#              /\// FunPay /\// 

#НЕТУ

#               /\// Telegram /\// 
# NuckerDLC1337
# NuckerDLC1337.t.me
# https://t.me/NuckerDLC1337