import random as ran
import time as t
juese = ['阿兰','虎克','雪衣','米沙','克拉拉','刃','镜流','丹恒·饮月','云璃','流萤','毁灭·开拓者',
         '彦卿','巡猎·三月七','丹恒','素裳','貊泽','希儿','托帕＆账账','飞霄','真理医生','波提欧',
         '翡翠','乱破','黑塔','希露瓦','青雀','姬子','景元','银枝',
         '同谐·开拓者','艾丝妲','停云','驭空','寒鸦','布洛妮娅','阮·梅','花火','知更鸟','星期日',
         '瓦尔特','佩拉','桑博','卢卡','桂乃芬','卡芙卡','银狼','椒丘','黑天鹅','黄泉','忘归人'
         '杰帕德','符玄','砂金','存护·三月七','存护·开拓者',
         '白露','藿藿','娜塔莎','玲可','加拉赫','罗刹','灵砂']
wuxing = ['克拉拉', '刃', '镜流', '丹恒·饮月', '云璃', '流萤',
         '彦卿', '希儿', '托帕＆账账', '飞霄', '真理医生', '波提欧',
         '翡翠', '乱破', '姬子', '景元', '银枝',
         '布洛妮娅', '阮·梅', '花火', '知更鸟','星期日'
         '瓦尔特', '卡芙卡', '银狼', '椒丘', '黑天鹅', '黄泉','忘归人'
         '杰帕德', '符玄', '砂金',
         '白露', '藿藿', '罗刹', '灵砂']
quanzhong = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]
count = 0
'''
m = input('请问要扳谁')
juese.remove(m)
quanzhong.remove(1)
'''
state = ''
while state != '0000':
    a = []
    while len(a) != 4:
        b = ran.choice(juese)
        x = juese.index(b)
        if b == '毁灭·开拓者' or b == '同谐·开拓者' or b == '存护·开拓者':
            if '毁灭·开拓者' in a or '同谐·开拓者' in a or '存护·开拓者' in a:
                continue
        if b == '巡猎·三月七' or b == '存护·三月七':
            if '巡猎·三月七' in a or '存护·三月七' in a:
                continue
        if b not in a and count <= 3 and quanzhong[x] == 1:
            if b in wuxing and count <= 2:
                count += 1
            a.append(b)
    for i in a:
        t.sleep(0.5)
        print(i,end=' ')
    print()
    print('请确认是否全部拥有，哪一个没有就在下面写1，例如0010')
    state = input()
    if state != '0000':
        for i in range(4):
            if state[i] == '1':
                x = juese.index(a[i])
                quanzhong[x] = 0
